Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/J03.e.tmx
Source language: en_us
Languages: zh_cn

source: 32 Functionalisation of Pyridine
zh_cn: 32 吡啶官能团化

source: This chapter examines functionalisation strategy - the addition of functional groups to a pre-formed carbon skeleton.
zh_cn: 本章讨论官能团化策略——在预先形成的碳骨架上添加官能团。

source: It revises previous sections in the context of some difficult reactions.
zh_cn: 在一些很难的反应里将会对之前的内容进行修订。

source: Introduction
zh_cn: 引言

source: A theme of this section is making reactions work. Usually that means making reactions that already work quite well work much better.
zh_cn: 使反应变得有效是这一部分的主题，这通常意味着要使已经不错的反应变得更加完美。

source: But we start with a reaction - electrophilic aromatic substitution on pyridines and related heterocycles - that doesn't really work at all.
zh_cn: 但是我们将从下面这个反应开始——吡啶及其相关杂环上的芳香亲电取代一通常这个反应都难以发生。

source: We shall see why not and how the reaction can be successfully realised.
zh_cn: 我们将看到它为什么难以发生，又如何让它成功进行。

source: This involves some serious mechanistic thinking and questions of regioselectivity are vital to the solution.
zh_cn: 这会涉及一些严肃的机理的思考，而区域选择性问题则显得至关重要。

source: This is new chemistry with a great future.
zh_cn: 这将是有着辉煌未来的新的化学。

source: PART I – THE PROBLEM
zh_cn: 第一部分——问题所在

source: Because it is such a familiar reaction, it can be forgotten that attack by electrophiles on benzene 1 is difficult because it gives an intermediate cation 2 which has lost the aromaticity of the starting material. This is, after all, why Lewis acids are needed for many such reactions.
zh_cn: 由于它是一个如此熟悉的反应，人们常常忘记由于亲电试剂向苯环1的进攻是困难的，因为它生成了一个失去起始原料芳香性的正离子中间体2，这就是为什么路易斯酸对于许多这种反应是必要的。

source: The product 3 has regained aromaticity but this is no help to the rate-determining step, the attack of the electrophile and the formation of 2.
zh_cn: 产物3重新获得了芳香性，但是这对于决速步一一亲电试剂进攻形成2的步骤并无帮助。

source: That the reaction occurs at all is because 2 is a delocalised pentadienyl cation and has some intrinsic stability as a cation.
zh_cn: 这个反应之所以能够发生是因为2是一个非定域戊二烯正离子，它作为一个正离子有其内在的稳定性。

source: Successful electrophilic substitution of benzene by HNO3/H2SO4, fuming H2SO4, RCOCl and AlCl3, or halogens with various Lewis acids is also testimony to the extreme reactivity of these combinations of reagents.
zh_cn: 用HNO3/H2SO4，发烟硫酸，RCOC1/A1C13以及卤素，并以路易斯酸促进的成功的苯环亲电取代反应都是这些联合试剂有限反应性的证明。

source: Pyridine has all the disadvantages of benzene plus some special ones of its own.
zh_cn: 吡啶拥有苯环所有的缺点，同时还有其独特的缺点。

source: Attack at the 2- or 4-positions 4 gives intermediate cations such as 5 which have part of the positive charge delocalised onto nitrogen 5c.
zh_cn: 在4的2-或4-位置进攻得到如5这样的正离子中间体，部分正电性离域到氮上5c。

source: This would be no bad thing if the nitrogen atom were tetravalent like stable NH4+, but it is actually divalent like the unknown, electron-deficient, and presumably very unstable NH2+.
zh_cn: 如果氮原子也像稳定的NH4+样是四价的，那么这也不坏，但实际上它是正二价的，就像未知的缺电子的而且可能不稳定的NH2+才一样。

source: Attack at the 3-position 6 is not so bad as the intermediate cation 7 is no longer delocalised onto the electron-deficient nitrogen atom but is not as stable as the benzene intermediate 5 and the slow step is very slow because the HOMO of pyridine is lower in energy than the HOMO of benzene.
zh_cn: 在3-位置进攻6就不是太坏，因为正离子中间体7的正电不会离域到缺电子的氮原子上，但也不如苯环的中间体5稳定，决速步非常慢，因为吡啶的HOMO能量远低于苯的HOMO能量。

source: So far electrophilic attack on pyridines sounds only a bit more difficult than that on benzenes but there is worse to come.
zh_cn: 现在看上去吡啶上的亲电取代只是比苯环上的困难一点，但还有更糟糕的。

source: The reagents for nitration, halogenation and so on all require strong protic or Lewis acid catalysts and these go for the pyridine nitrogen atom first.
zh_cn: 硝化、卤化等的试剂都要求强的给质子性或路易斯酸性，它们都首先在吡啶氮上反应。

source: Attempted nitration would have to occur on the cation 8, making the intermediate an impossibly unstable dication 9.
zh_cn: 尝试让硝化发生在正离子8上会使中间体是非常不稳定的双阳离子9。

source: N-Nitro Heterocycles as Nitrating Agents
zh_cn: 以N-硝基杂环作为硝化试剂

source: In fact, nitration of pyridine in the absence of protic or Lewis acid catalysts occurs at nitrogen.
zh_cn: 实际上，没有质子酸或路易斯酸催化下吡啶的硝基化发生在氮上。

source: The reagent has to be the rather unstable and moisture sensitive salt NO2+ BF4-.
zh_cn: 硝化试剂必须是非常不稳定、怕水的盐NO2+BF4-。

source: This is commercially available, though expensive.
zh_cn: 它可以购得，但是价格不菲。

source: The product is also not very stable but can be isolated as the tetrafluoroborate salt 11 as BF4- is non nucleophilic.
zh_cn: 产物同样不太稳定，但可以分离得到四氟化硼盐11，因为BF4-不具有亲核性。

source: This compound 11 is itself a nitrating agent and can be used to nitrate benzenes (but obviously not pyridine) simply by mixing in acetonitrile.
zh_cn: 化合物11本身也是一种硝化试剂，可用于苯的硝化（但显然不能用于吡啶），只需将其在乙腊中混合即可。

source: The products 12 have the usual substitution pattern for electrophilic substitution.
zh_cn: 产物12具有正常的亲电取代类型。

source: Olah has called this process 'transfer nitration'.
zh_cn: Olah把这个过程称为“转硝化”。

source: A better method for the same reaction (nitration of benzenes) is to use the product of nitration of pyrazole 13.
zh_cn: 实现同一个反应（苯的硝化）的更好的办法是用吡啶硝化产物13。

source: When the nitration is carried out in the absence of strong acid, the product is the N-nitro compound 14, a stable neutral molecule because a proton can be lost from the other nitrogen atom.
zh_cn: 当硝化在无强酸的条件下进行时，产物是N-硝基化合物14，它是一个稳定的中性分子，因为另一个N上可以失去一个质子。

source: This compound is stable but reacts with the Lewis acid BF3 to give an intermediate 15 that nitrates benzene efficiently.
zh_cn: 这个化合物是稳定的，但与路易斯酸BF3反应得到中间体15，它可以使苯高效硝化。

source: It is probable that the C-nitration of pyrazoles also takes place via such an intermediate as 15, see below.
zh_cn: 很可能C-硝基吡唑也会通过中间体15产生，如下图所示。

source: Pyridine can also be used as an efficient catalyst for the bromination of benzene (see Vogel, page 860) through reaction at the nitrogen atom 16 while the crystalline reagent pyridinium bromide perbromide 17 is a convenient way of brominating alkenes.
zh_cn: 吡啶同样可以作为一种高效的催化剂，通过16氮原子上的反应使苯环溴化（见Vogel，860页），而晶状的三溴化吡啶鎓试剂可以很容易溴化烯烃。

source: These are convincing illustrations that pyridine does not react with bromine at carbon.
zh_cn: 这些似乎都说明吡啶不与溴在碳原子上反应。

source: Direct electrophilic substitution of pyridines is not, in general, a useful reaction.
zh_cn: 通常在吡啶上的直接亲电取代都不是有用的反应。

source: Only 3-substitution is remotely possible as the intermediate 7 at least does not attempt to put the positive charges on the same atoms!
zh_cn: 只有3-取代有一定的可能性，因为中间体7至少不会将电荷离域到同一个原子上。

source: The maximum yield of 3-nitro-pyridine by direct nitration is 5%, normally 3% is expected.
zh_cn: 直接进行硝化得到3-硝基吡啶的最高产率是5%，—般只有3%。

source: If we want to carry out nitration on the pyridine ring, some means must be found better than normal electrophilic substitution.
zh_cn: 如果我们想在吡啶上进行硝化，必须找到比直接亲电取代更好的方法。

source: We shall now explore various ways in which this simple reaction can be achieved either by subterfuge or mechanistic ingenuity.
zh_cn: 我们现在就来探究实现这个简单的反应的多种方法，有的通过转化，有的通过巧妙的机理。

source: The same remarks apply to other electron-deficient six-membered aromatic heterocycles such as pyrimidine 20 and quinoline 22.
zh_cn: 这同样适用于其他缺电子六元芳香杂环，如嘧啶20和喹啉22。

source: Solutions to these problems are needed as many drugs and natural products contain these rings.
zh_cn: 因为许多天然产物都包含这些环，所以这个问题的解决非常重要。

source: The Pharmacia-Upjohn anti-AIDS drug PNU-142721 19 contains pyridine and pyrimidine rings while the coenzyme methoxatin 21, that allows bacteria to live off methane as their sole carbon source, contains an oxidised quinoline ring.
zh_cn: Pharmacia-Upjohn公司的抗AIDS药PNU-14272119就含有吡啶和嘧啶环，而辅酶吡咯咯喹啉醌21含有一个氧化的喹啉环，它的作用是使细菌能以甲烷作为它们的碳源而存活，其三个环都是多取代的。

source: All three rings are heavily substituted and preparation of these compounds needs regiochemically controlled substitution around the rings.
zh_cn: 这些化合物的合成需要在环上有区域选择性的取代。

source: PART II – TRADITIONAL SOLUTIONS: ADDITION OF ELECTRON-DONATING SUBSTITUENTS
zh_cn: 第二部分——传统的解决办法：添加供电子取代基止痛剂氟吡汀（flupirtine）

source: The analgesic Flupirtine 23 is a simple pyridine with three substituents at the 2, 3, and 6 positions.
zh_cn: 23是一个在2，3，6位置三取代的简单吡啶。

source: Removal of the amide shows the core 24.
zh_cn: 移除酰胺后可以看到主体24。

source: The 4-fl uorobenzylamine 25 could be added by nucleophilic substitution (easier in pyridines than in benzenes) and we shall delay the choice of the leaving group (X in 26) for the moment.
zh_cn: 4-氟节胺25可以通过亲核取代连接上去（在吡啶上比苯环上更容易），我们暂时不谈离去基团（26中的X）的选择。

source: The only amino group we could conceivably add by nitration is the one in the 3-position so we might continue by FGI (reduction) and C-N disconnection 27.
zh_cn: 我们可能通过硝化连上去的唯一的氨基就在3-位，然后我们可以通过FGI（还原）和C-N断键27来继续合成。

source: The nitro group will help the nucleophilic aromatic substitution so now we must choose the leaving group X in 27.
zh_cn: 硝基有助于亲核芳香取代，所以我们现在必须为27选择一个合适的离去基团X。

source: It need not be a good leaving group - the slow step in nucleophilic aromatic substitution is the addition of the nucleophile -so as long as X is a tolerable leaving group, it will do.
zh_cn: 它不必是一个好的离去基团——这个反应的决速步是亲核试剂的加成，所以X只要是一个可以的离去基团就行了。

source: It should promote electrophilic attack by NO2+ in the 3-position and 28; X= OMe should be available commercially.
zh_cn: 它应该能够促进NO才在3-位的亲核进攻，而28(X=OMe)是商业化的试剂。

source: Putting X =OMe fulfils all these conditions. Here is the synthesis.
zh_cn: X=OMe满足所有这些条件，下面是合成步骤。

source: Nitration of 28; X = OMe is successful because both electron-donating OMe and NH2 groups activate the 3-position and the intermediate cation 31 is delocalised over both N and O atoms.
zh_cn: 28的硝化是成功的，因为两个供电子基团OMe和NH3都活化了3-位点，且阳离子中间体31离域在N和O原子上。

source: We could have used lone pairs on either the OMe or NH2 groups to draw the mechanism 30.
zh_cn: 我们可以用OMe或NH3上的孤对电子来画出30这个机理。

source: The reaction occurs in spite of the pyridine ring rather than because of it.
zh_cn: 反应能够发生不是因为它是吡啶，而实际上与吡啶无关。

source: The position of attack - C3 or C5 - is not easily predicted and searching the literature or trial and error is needed.
zh_cn: 至于进攻的位点是C-3还是C-5则不容易预测，查找文献或者试验与犯错都是允许的。

source: Regioselectivity in Electrophilic Substitution with Electron-Donating Groups
zh_cn: 用供电子基团进行亲电取代的区域选择性

source: You might think that nowadays there would be no doubt about the results of such reactions as the nitration of 28 since NMR would quickly distinguish the possible products. This is not so as a notorious case shows.
zh_cn: 你可能认为现在硝化等反应的结果肯定是毫无疑问的，因为通过NMR可以迅速区分可能的产物，但是下面的例子却说明情况并不是这样的。

source: Though it was known that reaction of 33 with iodine in aqueous sodium carbonate gave the 2-iodo compound 34 in good yield, it was claimed in 1990 that a more complex reagent gave the 6-iodo isomer 32. Reinvestigation showed that 34 was the only product though the alternative 32 could be formed in moderate yield at higher temperature.
zh_cn: 尽管已知33与碘在碳酸钠水溶液中的反应以较高的产率得到2-碘代化合物34，但是1990年证实一个更加复杂的试剂可以得到6-碘代物异构体32o重新研究发现34是唯一的产物，虽然32可在更高的温度下以中等产率形成。

source: It was also known that chlorination gives the 2-chloro compound 35.
zh_cn: 氯化得到2-氯取代化合物35也是已知的。

source: The preference for the site next to nitrogen (and therefore para to the OH group) may be due to steric crowding of the solvated oxyanion in water.
zh_cn: 对N的邻位（也即OH的对位）的偏好可能与水中溶剂化的含氧酸根的空间位阻有关。

source: The synthesis of the drug PNU-142721 19 required a series of electrophilic substitutions on 3-hydroxy pyridine 33.
zh_cn: 合成PNU-14272119需要在3-羟基吡啶33上进行一系列的亲核取代。

source: Iodination of the chloride 35 went in the previously inaccessible 6- position to give 36.
zh_cn: 氯代物35进行碘化，将会在之前不可能的6-位点进行，得到36。

source: Now iodine-lithium exchange and reaction with acetaldehyde gave the secondary alcohol 37 and finally iodination gave the tetrasubstituted pyridine 38.
zh_cn: 然后碘-锂置换，与乙醛反应得到二级醇37，最后再碘化得到四取代吡啶38。

source: Each new substituent is added as an electrophile in a specific position. Only the acetaldehyde had no choice.
zh_cn: 除了乙醛别无选择外，每个取代基都作为亲核试剂加成到特定的位点。

source: Installation of the furan ring requires two extra carbons provided by a Sonagashira coupling with trimethylsilyl acetylene to give 39.
zh_cn: 呋喃环的安装需要由与三甲基甲硅烷基乙焕进行Sonagashira偶联提供的两个额外的碳，反应得到39。

source: Cu(I)-catalysed closure of the furan ring follows and now the role of the chlorine atom on the pyridine ring is revealed. It is there to block the most reactive position and, its job complete, it can now be removed by hydrogenation.
zh_cn: 接下来是Cu（I）催化的呋喃关环。这里我们就看出了吡啶环上氯取代原子的作用就是占据最具反应活性的位点，现在它的任务已经完成，可以用氢化将其移除了。

source: Completion of the synthesis of PNU-142721 19 requires introduction of asymmetry and coupling with a pyrimidine thiol.
zh_cn: 要完成PNU-14272119的合成需要引入不对称以及和一个嘧啶硫醇偶联。

source: Asymmetry was introduced in two ways.
zh_cn: 不对称性的引入通过两步完成。

source: The alcohol 41 was enantioselectively acylated with trifluoroethyl butyrate catalysed by porcine pancreatic lipase (chapter 29) or else a Swern oxidation gave the ketone that could be enantioselectively reduced with (-)-Dip chloride (chapter 24).
zh_cn: 醇41通过猪胰脂酶催化的（第29章）用三氟乙基丁酸酯对映选择性的酰化，或者用Swern氧化得到酮然后用（一）-二异松蒎基氯硼烷（第24章）对映选择性的还原。

source: Clean inversion from (S)-41 to the chloride (R)-42 was achieved only with the Mitsunobu-like reagent Ph3P/CCl4.
zh_cn: 从（S）-41到氯代CR）-42的翻转只能用类Mitsunobu试剂Ph3P/CCl4。

source: Finally, coupling with the thiolate anion of the pyrimidine 43 gave a second clean inversion. One recrystallisation improved the ee of the drug 19 from 97.6% to over 99%.
zh_cn: 最后与嘧啶的硫醇离子43的偶联得到第二此次干净的翻转，—次重结晶后将19的ee从97.6%提高到局于99%。

source: The Anti-Tumour Antibiotic Kedarcidin
zh_cn: 抗肿瘤抗菌素可达菌素

source: Another incorrect structure was revealed by synthetic work aimed at structure 44, alleged to be a part structure (the ‘chromophore’) of the antitumour antibiotic kedarcidin.
zh_cn: 一项旨在合成44的工作却得到另一个错误的结构，据称是抗肿瘤抗菌素可达菌素(kedarcidin)的一部分(发色团)。

source: The synthesis was successful but revealed that the structure was wrong as the compound is a β-amino acid and not an α-amino acid as had been assumed.
zh_cn: 合成很成功，但是最后发现结构不对，因为此化合物不是之前设想的a-氨基酸，而是一个β-氨基酸。

source: The obvious compounds to make are the pyridine amines for coupling to the undisputed naphthalene fragment.
zh_cn: 要得到这个化合物，显然应该将吡啶胺与萘片段偶联。

source: Both were made from the same pyridine 35 that featured in the last section.
zh_cn: 这两部分都从同一个吡啶35制得，这在前一部分已经讲过。

source: Iodination and protection gave two iodo-pyridines 46; R=TBDMS and MOM.
zh_cn: 碘化以及保护得到两个碘代吡啶46(R=TBDMS和R=MOM)。

source: The first was combined with Jackson's d3 reagent 47 (chapter 13) in a Negishi coupling to give 48 and the second in a Heck reaction to give the unsaturated ester 49 to which Davies’s chiral lithium amide (chapter 24) could be added to give a 97:3 ratio of 50 and its diastereoisomer.
zh_cn: 前者通过Negishi偶联与Jacksond3试剂结合得到48，后者通过Heck反应得到不饱和酯49，Davies手性胺锂(第24章)可以加成上去以97:3得到50和它的非对映异构体。

source: Deprotection of 48 gave the amine needed for the synthesis of 44: this proved not to be the natural product.
zh_cn: 48脱质子得到合成44所需的胺，而44被证明不是一个真正的天然产物。

source: The synthesis of the correct structure 45 had a curious twist: removal of the benzyl groups from 50 resulted in dechlorination 51 and the chlorine was reinstated 52 with another electrophilic substitution having the same regioselectivity as that of 35.
zh_cn: 正确结构45的合成有一个有意思的扭转：从50除去苯基导致51去氯化，而通过另一个与35具有相同区域选择性的亲电取代复原氯。

source: Halogenation and Metallation
zh_cn: 卤化和金属取代

source: To summarise these last two examples: with even one electron-donating group on the pyridine ring, halogenation becomes a useful reaction.
zh_cn: 总结一下前面的两个例子：吡啶环上至少有一个供电子基时，卤化就是一个有用的反应。

source: Metallation with lithium or palladium-catalysed couplings with alkenes (Heck), organo-zinc compounds, including those with β-hydrogens (Negishi), or boronic acids (Suzuki) make new C-C bonds while Buchwald-Hartwig chemistry makes new bonds to O or N atoms. These are obviously very versatile sequences.
zh_cn: 进行金属化，如用锂试剂，钳催化偶联（Heck烯烃化），有机锌化合物，还有β-氢（Negishi）或硼酸（Suzuki）的C-C偶联，用Buch-wald-Hartwig方法与O或N原子偶联，等等，都可以多方面适应合成的需要。

source: Pyridine N-Oxides in Electrophilic Substitution
zh_cn: 亲电取代中的吡啶N-氧化物

source: This is all very well if your target molecule happens to have electron-donating substituents on the pyridine ring, but what if it hasn't? The traditional solution is to use a pyridine N-oxide 53 which simultaneously blocks the lone pair on nitrogen and provides a strongly electron-donating substituent.
zh_cn: 当目标分子刚好含有供电子取代基时，上面提到的这些都很好用，但如果没有呢？传统的解决办法是用一个吡啶N-氧化物53，既阻止了N上孤电子对的反应，本身又是一个强供电子取代基。

source: Pyridines are easily oxidised to N-oxides with H2O2 (another instance of electrophilic attack at N) and the substituted N-oxides 54 are easily reduced back to the pyridines 55 with trivalent phosphorus compounds such as PCl3.
zh_cn: 吡啶很容易用H2O2氧化（这又是一个在N上的亲电进攻），而取代的N-氧化物也很容易用三价磷化合物如PCl3，还原成吡啶55。

source: Nitration can be carried out with the usual reagents and occurs in the 4-position (the 2- and 6-positions being sterically hindered by the solvated oxido group).
zh_cn: 硝化可以用通常的试剂进行，发生在4-位（2-和6-位都有溶剂化的氧的空间位阻）。

source: The electrons from oxygen are used in the reaction 56 and the nitrogen atom retains its positive charge throughout but the intermediate 57 is only a mono-cation unlike 9.
zh_cn: 氧上的电子在反应56中发挥作用，整个过程中氮原子保持它的正电荷，但是中间体57不像9，而是一个一价阳离子。

source: This is a good synthesis of 4-nitropyridine 59.
zh_cn: 这是合成59的不错的方法。

source: The deoxygenation of the product can be developed in synthetically useful ways.
zh_cn: 产物的去氧化可用合成上很有用的方法来进行。

source: If there is an electron-withdrawing group at the 3-position and PCl3 is used, deoxygenation is accompanied by chlorination at the 2-position 62.
zh_cn: 如果在3-位点有一个拉电子基就用PCl3，去氧化将伴随2-位的氯化62。

source: This new chlorine is activated towards nucleophilic aromatic substitution both by its position on the pyridine ring and by the electron-withdrawing group at the 3-position and can be replaced by O, N, S, or P nucleophiles 63.
zh_cn: 这个氯提高了芳香亲核取代的活性，不仅因为它在吡啶环上的位置，也因为3-位的拉电子基，它容易被O，N，S或P亲核试剂取代63。

source: Pyridines such as 61 are easily made from available nicotinic acid, pyridine-3-carboxylic acid 60.
zh_cn: 如61这样的吡啶很容易从易得的烟酸，吡啶3-羧酸制备。
